# Exercise 2.1

In [10]:
import pandas as pd
import numpy as np

#Data Frame
df=pd.read_csv('Zb_6.txt')
df.head()

         a_1                a_2        a_3  id
0   5.176457   10.1034259615354  23.596614   0
1  36.622414   -10.571109763845  12.457893   0
2  -6.792371  -6.79771975597544  -0.622541   0
3  17.943963   -4.6638432049658 -24.650001   0
4   9.760326   29.8440839812575  -3.551850   0

In [11]:
#Check Data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a_1     1997 non-null   float64
 1   a_2     1997 non-null   object
 2   a_3     1998 non-null   float64
 3   id      2000 non-null   int64
dtypes: float64(2), int64(1), object(1)
memory usage: 62.6+ KB

In [12]:
# Convert data type column a_2 to numeric because the original data detect object.
df['a_2'] = pd.to_numeric(df['a_2'], errors='coerce')
#Check Data once more
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a_1     1997 non-null   float64
 1   a_2     1996 non-null   float64
 2   a_3     1998 non-null   float64
 3   id      2000 non-null   int64
dtypes: float64(3), int64(1)
memory usage: 62.6 KB

In [13]:
#Check a missing value
df.isnull().any(axis = 0)

a_1     True
a_2     True
a_3     True
id     False
dtype: bool

In [14]:
#Check a sum of the missing value
df.isnull().sum(axis = 0)

a_1    3
a_2    4
a_3    2
id     0
dtype: int64

In [15]:
#Removing missing values
print('Before removing missing values:', len(df))
df.dropna(axis=0, inplace=True)
print('After removing missing values:', len(df))

Before removing missing values: 2000
After removing missing values: 1991

In [16]:
df.head()

         a_1        a_2        a_3  id
0   5.176457  10.103426  23.596614   0
1  36.622414 -10.571110  12.457893   0
2  -6.792371  -6.797720  -0.622541   0
3  17.943963  -4.663843 -24.650001   0
4   9.760326  29.844084  -3.551850   0

In [17]:
#Reset index
df.reset_index(drop=True)

            a_1        a_2        a_3  id
0      5.176457  10.103426  23.596614   0
1     36.622414 -10.571110  12.457893   0
2     -6.792371  -6.797720  -0.622541   0
3     17.943963  -4.663843 -24.650001   0
4      9.760326  29.844084  -3.551850   0
...         ...        ...        ...  ..
1986 -10.745930   2.442456  18.557715   0
1987 -44.371389 -15.758540  -4.280358   0
1988 -13.005429  -9.075630  27.234526   0
1989 -38.508707   0.324857 -26.717929   0
1990 -11.754451  10.589119  11.194008   0

[1991 rows x 4 columns]

In [18]:
#Outliers

# Removing the outliers
def removeOutliers(df, col):
    Q3 = np.quantile(df[col], 0.75)
    Q1 = np.quantile(df[col], 0.25)
    IQR = Q3 - Q1

    print("IQR value for column %s is: %s" % (col, IQR))
    global outlier_free_list
    global filtered_data

    lower_range = Q1 - 1.5 * IQR
    upper_range = Q3 + 1.5 * IQR
    outlier_free_list = [x for x in df[col] if (
        (x > lower_range) & (x < upper_range))]
    filtered_data = df.loc[df[col].isin(outlier_free_list)]

for i in df.columns:
    if i == df.columns[0]:
        removeOutliers(df, i)
    else:
        removeOutliers(filtered_data, i)


# Assigning filtered data back to our original variable
df = filtered_data
print("Shape of data after outlier removal is: ", df.shape)

IQR value for column a_1 is: 31.3547700246785
IQR value for column a_2 is: 27.8882062443202
IQR value for column a_3 is: 27.951309906392503
IQR value for column id is: 0.0
Shape of data after outlier removal is:  (0, 4)